##### to create a data frame from dictionary

In [19]:
import numpy as np
dict1 = {'A':[1,2,3], 'B':[4, np.NaN, 5], 'C':[6, np.NaN, np.NaN]}

import pandas as pd
df = pd.DataFrame(dict1)

In [20]:
df

   A    B    C
0  1  4.0  6.0
1  2  NaN  NaN
2  3  5.0  NaN

##### delete na va,ues

In [21]:
df.dropna()
# delete all rows with na values

   A    B    C
0  1  4.0  6.0

In [22]:
df.dropna(axis=1)
# delete all columns with na values

   A
0  1
1  2
2  3

##### to delete with threshold

In [23]:
df.dropna(thresh=2)

# delete rows with 2 or more na values

   A    B    C
0  1  4.0  6.0
2  3  5.0  NaN

In [24]:
df.dropna(axis=1, thresh=2)

# delete columns with 2 or more na values

   A    B
0  1  4.0
1  2  NaN
2  3  5.0

###### to fill missing values

In [25]:
df.fillna(df.mean())

#fill na with mean of the column

   A    B    C
0  1  4.0  6.0
1  2  4.5  6.0
2  3  5.0  6.0

In [27]:
df['B'].fillna(value=df['B'].mean())

0    4.0
1    4.5
2    5.0
Name: B, dtype: float64

In [28]:
df.mean()

A    2.0
B    4.5
C    6.0
dtype: float64